Tekla Open API Reference for Tekla Structures 2025
Mark.Delete Method
 Calls the system to delete the mark attached to a model object. After this operation, only associative notes can be attached to that model object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Delete()
Public Overrides Function Delete As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
Mark Class
Tekla.Structures.Drawing Namespace